app/controllers/songs_controller.rb

  def index
    if params[:artist_id]
      if artist = Artist.find_by(id: params[:artist_id])
        @songs = artist.songs
      else
        flash[:alert] = "Artist not found."
        redirect_to artists_path
      end
    else
      @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 5]]

  def show
    if params[:author_id]
      if artist = Artist.find_by(id: params[:author_id])
        if artist.posts.find(id: params[:id])
          @song = artist.posts.find(id: params[:id])
        else
          flash[:alert] = "Song not found."
          redirect_to artist_songs_path
        end
      else
        flash[:alert] = "Artist not found."
        redirect_to artists_path
      end
    else
      if Song.find_by(id: params[:id])
        @song = Song.find_by(id: params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 7]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "id"."id" = '12345' LIMIT 1  [["artist_id", 5]]